In [1]:
%load_ext sql

In [2]:
%sql sqlite:///myfile.db

In [3]:
%%sql
SELECT 
	country, 
    MIN(date_account_start) AS first_account
FROM customers
GROUP BY country
ORDER BY first_account ASC;

 * sqlite:///myfile.db
Done.

[('France', '2017-01-13'),
 ('Hungary', '2017-01-18'),
 ('Belgium', '2017-01-28'),
 ('Slovenia', '2017-01-31'),
 ('Spain', '2017-02-14'),
 ('Italy', '2017-02-28'),
 ('Poland', '2017-03-03'),
 ('Great Britan', '2017-03-31'),
 ('Denmark', '2017-04-30'),
 ('USA', '2017-09-13'),
 ('Austria', '2017-11-22')]

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite:///myfile.db

In [6]:
%%sql
SELECT movie_id -- Select movie IDs with less than 5 views
FROM renting
GROUP BY movie_id
HAVING COUNT(*) < 5

 * sqlite:///myfile.db
Done.

[(17,), (20,), (43,), (55,), (56,), (60,)]

In [7]:
%%sql
SELECT *
FROM movies
where movie_id in  -- Select movie IDs from the inner query
	(SELECT movie_id
	FROM renting
	GROUP BY movie_id
	HAVING COUNT(*) > 5) limit 5;

 * sqlite:///myfile.db
Done.

[(1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (2, 'Swordfish', 'Drama', 99, 2001, 2.19),
 (3, 'What Women Want', 'Comedy', 127, 2001, 2.59),
 (4, 'Training Day', 'Drama', 122, 2001, 1.79),
 (5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, 2.59)]

In [8]:
%%sql
SELECT *
FROM customers
where    customer_id in         -- Select all customers with more than 10 movie rentals
	(SELECT customer_id
	FROM renting
	GROUP BY customer_id
	having count(customer_id) > 10);

 * sqlite:///myfile.db
Done.

[(21, 'Avelaine Corbeil', 'France', 'female', '1986-03-17', '2017-06-11'),
 (28, 'Sidney Généreux', 'France', 'male', '1980-12-01', '2017-02-04'),
 (49, 'Havasy Kristof', 'Hungary', 'male', '1998-06-13', '2017-01-18'),
 (92, 'Honorata Nowak', 'Poland', 'female', '1986-05-02', '2017-09-21'),
 (113, 'Lucy Centeno Barrios', 'Spain', 'female', '1970-11-03', '2017-06-13'),
 (114, 'Canela Gaona Lozano', 'Spain', 'female', '1997-04-01', '2017-02-14')]

In [9]:
%%sql
SELECT AVG(rating) -- Calculate the total average rating
FROM renting;

 * sqlite:///myfile.db
Done.

[(7.939024390243903,)]

In [10]:
%%sql
SELECT movie_id,  -- Select movie IDs and calculate the average rating 
       AVG(rating)
FROM renting
GROUP BY movie_id
HAVING AVG(rating) >   -- Of movies with rating above average
	(SELECT AVG(rating)
	FROM renting) limit 5;

 * sqlite:///myfile.db
Done.

[(3, 9.0), (5, 9.75), (6, 8.8), (7, 8.0), (8, 8.0)]

In [11]:
%%sql
SELECT title -- Report the movie titles of all movies with average rating higher than the total average
FROM movies
WHERE movie_id IN
	(SELECT movie_id
	 FROM renting
     GROUP BY movie_id
     HAVING AVG(rating) > 
		(SELECT AVG(rating)
		 FROM renting)) limit 5;

 * sqlite:///myfile.db
Done.

[('What Women Want',),
 ('The Fellowship of the Ring',),
 ("Harry Potter and the Philosopher's Stone",),
 ('The Royal Tenenbaums',),
 ('Waking Up in Reno',)]

In [12]:
%%sql
-- Count movie rentals of customer 45
SELECT COUNT(*)
FROM renting as r
WHERE r.customer_id = 45;

 * sqlite:///myfile.db
Done.

[(5,)]

In [13]:
%%sql
-- Select customers with less than 5 movie rentals
SELECT *
FROM customers as c
WHERE 5 > 
	(SELECT count(*)
	FROM renting as r
	WHERE r.customer_id=c.customer_id) limit 5;

 * sqlite:///myfile.db
Done.

[(2, 'Wolfgang Ackermann', 'Austria', 'male', '1971-11-17', '2018-10-15'),
 (3, 'Daniela Herzog', 'Austria', 'female', '1974-08-07', '2019-02-14'),
 (4, 'Julia Jung', 'Austria', 'female', '1991-01-04', '2017-11-22'),
 (5, 'Juliane Kirsch', 'Austria', 'female', '1977-03-01', '2018-12-16'),
 (6, 'Rowanne Couperus', 'Belgium', 'female', '1994-04-05', '2018-08-26')]

In [14]:
%%sql
-- Calculate the minimum rating of customer with ID 7
SELECT MIN(rating)
FROM renting
WHERE customer_id = 7;

 * sqlite:///myfile.db
Done.

[(8.0,)]

In [15]:
%%sql
SELECT *
FROM customers AS c
WHERE 4 >  -- Select all customers with a minimum rating smaller than 4
	(SELECT MIN(rating)
	FROM renting AS r
	WHERE r.customer_id = c.customer_id);

 * sqlite:///myfile.db
Done.

[(28, 'Sidney Généreux', 'France', 'male', '1980-12-01', '2017-02-04'),
 (41, 'Zara Mitchell', 'Great Britan', 'female', '1994-07-08', '2017-06-12'),
 (86, 'Albin Jaworski', 'Poland', 'male', '1984-05-01', '2017-12-15'),
 (120, 'Robin J. Himes', 'USA', 'male', '1988-11-30', '2018-08-06')]

In [16]:
%%sql
SELECT *
FROM movies AS m
WHERE 5 < -- Select all movies with more than 5 ratings
	(SELECT COUNT(rating)
	FROM renting AS r
	WHERE r.movie_id = m.movie_id) limit 5;

 * sqlite:///myfile.db
Done.

[(4, 'Training Day', 'Drama', 122, 2001, 1.79),
 (10, 'Simone', 'Drama', 117, 2002, 2.69),
 (12, 'The Two Towers', 'Science Fiction & Fantasy', 179, 2002, 2.39),
 (14, 'The Recruit', 'Mystery & Suspense', 115, 2003, 1.69),
 (22, 'Imagining Argentina', 'Art House & International', 107, 2004, 2.59)]

In [17]:
%%sql
SELECT *
FROM movies AS m
WHERE 8 <  -- Select all movies with an average rating higher than 8
	(SELECT avg(rating)
	FROM renting AS r
	WHERE r.movie_id = m.movie_id) limit 5;

 * sqlite:///myfile.db
Done.

[(3, 'What Women Want', 'Comedy', 127, 2001, 2.59),
 (5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, 2.59),
 (6, "Harry Potter and the Philosopher's Stone", 'Science Fiction & Fantasy', 152, 2001, 2.69),
 (9, "11'09''01 September 11", 'Drama', 134, 2002, 2.99),
 (16, '25th Hour', 'Drama', 135, 2003, 1.59)]

In [18]:
%%sql
SELECT *
FROM renting
WHERE rating IS NOT NULL -- Exclude those with null ratings
AND customer_id = 115;

 * sqlite:///myfile.db
Done.

[]

In [19]:
%%sql
SELECT *
FROM customers AS c -- Select all customers with at least one rating
WHERE EXISTS
	(SELECT *
	FROM renting AS r
	WHERE rating IS NOT NULL 
	AND r.customer_id = c.customer_id) limit 5;

 * sqlite:///myfile.db
Done.

[(2, 'Wolfgang Ackermann', 'Austria', 'male', '1971-11-17', '2018-10-15'),
 (4, 'Julia Jung', 'Austria', 'female', '1991-01-04', '2017-11-22'),
 (7, 'Annelous Sneep', 'Belgium', 'female', '1993-11-14', '2018-05-12'),
 (8, 'Jaëla van den Dolder', 'Belgium', 'female', '1990-08-31', '2018-02-08'),
 (10, 'Arnout Veenhuis', 'Belgium', 'male', '1984-07-26', '2017-01-28')]

In [20]:
%%sql
SELECT *
FROM renting
WHERE rating IS NOT NULL -- Exclude null ratings
AND customer_id = 1; -- Select all ratings from customer with ID 1

 * sqlite:///myfile.db
Done.

[(421, 1, 71, 10.0, '2019-01-21'), (520, 1, 39, 6.0, '2018-12-29')]

In [21]:
%%sql
SELECT *  -- Select the records from the table `actsin` of all actors who play in a Comedy
FROM actsin AS ai
LEFT JOIN movies AS m
ON ai.movie_id = m.movie_id
WHERE m.genre = 'Comedy' limit 4;

 * sqlite:///myfile.db
Done.

[(133, 1, 89, 1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (140, 1, 95, 1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (163, 1, 110, 1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (88, 3, 56, 3, 'What Women Want', 'Comedy', 127, 2001, 2.59)]

In [22]:
%%sql
SELECT *
FROM actsin AS ai
LEFT JOIN movies AS m
ON m.movie_id = ai.movie_id
WHERE m.genre = 'Comedy'
and ai.actor_id = 1; -- Select only the actor with ID 1

 * sqlite:///myfile.db
Done.

[]

In [23]:
%%sql
SELECT *
FROM actors AS a
WHERE EXISTS
	(SELECT *
	 FROM actsin AS ai
	 LEFT JOIN movies AS m
	 ON m.movie_id = ai.movie_id
	 WHERE m.genre = 'Comedy'
	 AND ai.actor_id = a.actor_id) limit 4;

 * sqlite:///myfile.db
Done.

[(2, 'Adam Sandler', 1966.0, 'USA', 'male'),
 (3, 'Al Pacino', 1940.0, 'USA', 'male'),
 (6, 'Anjelica Huston', 1951.0, 'USA', 'female'),
 (14, 'Bill Nighy', 1949.0, 'British', 'male')]

In [24]:
%%sql

SELECT a.nationality, count(*) as count 
-- Report the nationality and the number of actors for each nationality
FROM actors AS a
WHERE EXISTS
    (SELECT ai.actor_id
     FROM actsin AS ai
     LEFT JOIN movies AS m
     ON m.movie_id = ai.movie_id
     WHERE m.genre = 'Comedy'
     AND ai.actor_id = a.actor_id)
group by a.nationality
order by count DESC;

 * sqlite:///myfile.db
Done.

[('USA', 22),
 ('British', 3),
 ('South Africa', 1),
 ('Northern Ireland', 1),
 ('Canada', 1)]

In [25]:
%%sql
SELECT name,   -- Report the name, nationality and the year of birth
       nationality, 
       year_of_birth
FROM actors
WHERE nationality <> 'USA' limit 5; -- Of all actors who are not from the USA

 * sqlite:///myfile.db
Done.

[('Abbie Cornish', 'Australia', 1982.0),
 ('Andrea Riseborough', 'British', 1981.0),
 ('Anthony Hopkins', 'British', 1937.0),
 ('Barkhad Abdi', 'Somalia', 1985.0),
 ('Barry Pepper', 'Canada', 1970.0)]

In [26]:
%%sql
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE nationality <> 'USA'
union -- Select all actors who are not from the USA and all actors who are born after 1990
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE year_of_birth > 1990 limit 5;

 * sqlite:///myfile.db
Done.

[('Abbie Cornish', 'Australia', 1982.0),
 ('Andrea Riseborough', 'British', 1981.0),
 ('Annasophia Robb', 'USA', 1993.0),
 ('Anthony Hopkins', 'British', 1937.0),
 ('Barkhad Abdi', 'Somalia', 1985.0)]

In [27]:
%%sql
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE nationality <> 'USA'
intersect -- Select all actors who are not from the USA and who are also born after 1990
SELECT name, 
       nationality, 
       year_of_birth
FROM actors
WHERE year_of_birth > 1990;

 * sqlite:///myfile.db
Done.

[('Freddie Highmore', 'British', 1992.0)]

In [28]:
%%sql
SELECT movie_id -- Select the IDs of all movies with average rating higher than 9
FROM renting
GROUP BY movie_id
HAVING AVG(rating) > 9;

 * sqlite:///myfile.db
Done.

[(5,), (42,), (48,), (63,)]

In [29]:
%%sql
SELECT movie_id
FROM movies
WHERE genre = 'Drama'
intersect  -- Select the IDs of all dramas with average rating higher than 9
SELECT movie_id
FROM renting
GROUP BY movie_id
HAVING AVG(rating)>9;

 * sqlite:///myfile.db
Done.

[(42,)]

In [30]:
%%sql
SELECT *
FROM movies
WHERE genre = 'Drama'
intersect  -- Select the IDs of all dramas with average rating higher than 9
SELECT movie_id
FROM renting
GROUP BY movie_id
HAVING AVG(rating)>9;

 * sqlite:///myfile.db
(sqlite3.OperationalError) SELECTs to the left and right of INTERSECT do not have the same number of result columns
[SQL: SELECT *
FROM movies
WHERE genre = 'Drama'
intersect  -- Select the IDs of all dramas with average rating higher than 9
SELECT movie_id
FROM renting
GROUP BY movie_id
HAVING AVG(rating)>9;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [31]:
%%sql
SELECT *
FROM movies
WHERE movie_id IN -- Select all movies of genre drama with average rating higher than 9
   (SELECT movie_id
    FROM movies
    WHERE genre = 'Drama'
    INTERSECT
    SELECT movie_id
    FROM renting
    GROUP BY movie_id
    HAVING AVG(rating)>9);

 * sqlite:///myfile.db
Done.

[(42, 'No Country for Old Men', 'Drama', 122, 2007, 1.49)]

In [32]:
%%sql
SELECT gender,  -- Extract information of a pivot table of gender and country for the number of customers
	   country,
	   COUNT(*)
FROM customers
GROUP BY CUBE (gender, country)
ORDER BY country;

 * sqlite:///myfile.db
(sqlite3.OperationalError) no such function: CUBE
[SQL: SELECT gender,  -- Extract information of a pivot table of gender and country for the number of customers
	   country,
	   COUNT(*)
FROM customers
GROUP BY CUBE (gender, country)
ORDER BY country;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [33]:
%%sql
SELECT 
    CASE WHEN gender IS NULL THEN 'All' ELSE gender END AS gender,
    CASE WHEN country IS NULL THEN 'All' ELSE country END AS country,
    COUNT(*) AS count
FROM customers
GROUP BY gender, country 
order by country limit 5;

 * sqlite:///myfile.db
Done.

[('female', 'Austria', 3),
 ('male', 'Austria', 1),
 ('female', 'Belgium', 3),
 ('male', 'Belgium', 3),
 ('female', 'Denmark', 4)]

In [34]:
%%sql
SELECT year_of_release,
       genre,
	   COUNT(*)
FROM movies
GROUP BY  year_of_release, genre
ORDER BY year_of_release;

 * sqlite:///myfile.db
(sqlite3.OperationalError) no such column: year_of_release
[SQL: SELECT year_of_release,
       genre,
	   COUNT(*)
FROM movies
GROUP BY  year_of_release, genre
ORDER BY year_of_release;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

In [36]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?